# deleteメソッド
# `!` をつけると破壊的メソッドに
# `^` が引数の先頭にあると、指定した文字列以外を削除
# `-` は両端に文字がある場合は範囲指定
# `,` 区切りで引数を複数指定した場合は、全ての引数にマッチした文字が削除対象

s = '1234567890'

p s.delete("^1-5") # => "12345"

p s.delete("1-5") # => "67890"

p s.delete("^1-5", "1-5") # => "1234567890"

p s.delete("^2-4", "^6-8") # => "234678"

p '------------------------------------'
# test
str = "-1234567890-"

p str.delete("2-41-") # => "567890"

p str.delete("^2-41-") # => "-1234-"

p str.delete("0^5-9-") # => "1234"

p str.delete("05-9", "^1-4-") # => "-1234-"

p '------------------------------------'

str = "abcd"
p str.delete("ac") # => "bd"
